MikroElektronika/mikrosdk_v2/targets/pic_16bit/mikroe/dspic/include/pps/hal_ll_pps_connection_defs/PIC24EP256GU814/hal_ll_pps_connection_defs.h
    {PIN_2, PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 50, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RC3_RPI51
    {PIN_3, PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 51, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RC4_RPI52
    {PIN_4, PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 52, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RD0_RP64
    {PIN_0, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 64, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RD1_RP65
    {PIN_1, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 65, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RD10_RPI74
    {PIN_10, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 74, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RD11_RPI75
    {PIN_11, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 75, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RD12_RPI76
    {PIN_12, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 76, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RD13_RPI77
    {PIN_13, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 77, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RD14_RPI78
    {PIN_14, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 78, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RD15_RP79
    {PIN_15, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 79, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RD2_RP66
    {PIN_2, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 66, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RD3_RP67
    {PIN_3, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 67, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RD4_RP68
    {PIN_4, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 68, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RD5_RP69
    {PIN_5, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 69, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RD6_RP70
    {PIN_6, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 70, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RD7_RP71
    {PIN_7, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 71, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RD8_RPI72
    {PIN_8, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 72, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RD9_RPI73
    {PIN_9, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 73, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RE0_RP80
    {PIN_0, PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 80, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RE1_RPI81
    {PIN_1, PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 81, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RE2_RP82
    {PIN_2, PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 82, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RE3_RPI83
    {PIN_3, PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 83, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RE4_RP84
    {PIN_4, PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 84, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RE5_RP85
    {PIN_5, PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 85, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RE6_RPI86
    {PIN_6, PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 86, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RE7_RP87
    {PIN_7, PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 87, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RE8_RPI88
    {PIN_8, PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 88, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RE9_RPI89
    {PIN_9, PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 89, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RF0_RP96
    {PIN_0, PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 96, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RF1_RP97
    {PIN_1, PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 97, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RF12_RP108
    {PIN_12, PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 108, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RF13_RP109
    {PIN_13, PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 109, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RF2_RP98
    {PIN_2, PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 98, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RF3_RP99
    {PIN_3, PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 99, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RF4_RP100
    {PIN_4, PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 100, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RF5_RP101
    {PIN_5, PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 101, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RF8_RP104
    {PIN_8, PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 104, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RG0_RP112
    {PIN_0, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 112, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RG1_RP113
    {PIN_1, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 113, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RG12_RPI124
    {PIN_12, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 124, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RG13_RP125
    {PIN_13, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 125, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RG14_RP126
    {PIN_14, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 126, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RG15_RP127
    {PIN_15, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 127, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RG6_RP118
    {PIN_6, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 118, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RG7_RPI119
    {PIN_7, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 119, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RG8_RP120
    {PIN_8, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 120, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI3_MISO_RG9_RPI121
    {PIN_9, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 121, HAL_LL_PPS_MODULE_INDEX_3, HAL_LL_RPINR29_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RA0_RPI16
    {PIN_0, PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 16, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RA1_RPI17
    {PIN_1, PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 17, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RA14_RPI30
    {PIN_14, PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 30, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RA15_RPI31
    {PIN_15, PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 31, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RA2_RPI18
    {PIN_2, PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 18, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RA3_RPI19
    {PIN_3, PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 19, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RA4_RPI20
    {PIN_4, PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 20, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RA5_RPI21
    {PIN_5, PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 21, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RA6_RPI22
    {PIN_6, PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 22, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RA7_RPI23
    {PIN_7, PORT_A, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 23, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RB0_RPI32
    {PIN_0, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 32, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RB1_RPI33
    {PIN_1, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 33, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RB10_RPI42
    {PIN_10, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 42, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RB11_RPI43
    {PIN_11, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 43, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RB12_RPI44
    {PIN_12, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 44, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RB13_RPI45
    {PIN_13, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 45, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RB14_RPI46
    {PIN_14, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 46, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RB15_RPI47
    {PIN_15, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 47, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RB2_RPI34
    {PIN_2, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 34, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RB3_RPI35
    {PIN_3, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 35, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RB4_RPI36
    {PIN_4, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 36, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RB5_RPI37
    {PIN_5, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 37, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RB6_RPI38
    {PIN_6, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 38, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RB7_RPI39
    {PIN_7, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 39, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RB8_RPI40
    {PIN_8, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 40, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RB9_RPI41
    {PIN_9, PORT_B, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 41, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RC1_RPI49
    {PIN_1, PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 49, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RC12_RPI60
    {PIN_12, PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 60, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RC13_RPI61
    {PIN_13, PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 61, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RC14_RPI62
    {PIN_14, PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 62, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RC2_RPI50
    {PIN_2, PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 50, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RC3_RPI51
    {PIN_3, PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 51, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RC4_RPI52
    {PIN_4, PORT_C, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 52, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RD0_RP64
    {PIN_0, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 64, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RD1_RP65
    {PIN_1, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 65, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RD10_RPI74
    {PIN_10, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 74, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RD11_RPI75
    {PIN_11, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 75, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RD12_RPI76
    {PIN_12, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 76, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RD13_RPI77
    {PIN_13, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 77, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RD14_RPI78
    {PIN_14, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 78, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RD15_RP79
    {PIN_15, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 79, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RD2_RP66
    {PIN_2, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 66, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RD3_RP67
    {PIN_3, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 67, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RD4_RP68
    {PIN_4, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 68, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RD5_RP69
    {PIN_5, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 69, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RD6_RP70
    {PIN_6, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 70, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RD7_RP71
    {PIN_7, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 71, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RD8_RPI72
    {PIN_8, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 72, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RD9_RPI73
    {PIN_9, PORT_D, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 73, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RE0_RP80
    {PIN_0, PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 80, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RE1_RPI81
    {PIN_1, PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 81, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RE2_RP82
    {PIN_2, PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 82, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RE3_RPI83
    {PIN_3, PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 83, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RE4_RP84
    {PIN_4, PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 84, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RE5_RP85
    {PIN_5, PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 85, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RE6_RPI86
    {PIN_6, PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 86, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RE7_RP87
    {PIN_7, PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 87, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RE8_RPI88
    {PIN_8, PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 88, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RE9_RPI89
    {PIN_9, PORT_E, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 89, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RF0_RP96
    {PIN_0, PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 96, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RF1_RP97
    {PIN_1, PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 97, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RF12_RP108
    {PIN_12, PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 108, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RF13_RP109
    {PIN_13, PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 109, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RF2_RP98
    {PIN_2, PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 98, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RF3_RP99
    {PIN_3, PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 99, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RF4_RP100
    {PIN_4, PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 100, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RF5_RP101
    {PIN_5, PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 101, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RF8_RP104
    {PIN_8, PORT_F, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 104, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RG0_RP112
    {PIN_0, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 112, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RG1_RP113
    {PIN_1, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 113, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RG12_RPI124
    {PIN_12, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 124, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RG13_RP125
    {PIN_13, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 125, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RG14_RP126
    {PIN_14, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 126, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RG15_RP127
    {PIN_15, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 127, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RG6_RP118
    {PIN_6, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 118, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RG7_RPI119
    {PIN_7, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 119, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RG8_RP120
    {PIN_8, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 120, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif
    #ifdef SPI4_MISO_RG9_RPI121
    {PIN_9, PORT_G, HAL_LL_GPIO_DIGITAL_INPUT, HAL_LL_PPS_FUNCTIONALITY_SPI_MISO, 121, HAL_LL_PPS_MODULE_INDEX_4, HAL_LL_RPINR31_REG_ADDRESS},
    #endif

    { HAL_LL_PIN_NC, HAL_LL_PORT_NC, HAL_LL_PIN_NC, HAL_LL_PIN_NC, HAL_LL_PIN_NC, HAL_LL_MODULE_ERROR, HAL_LL_MODULE_ERROR }
};

